Repository: Noritinho/Web-Api
Catalog: src/Exceptions/Resources/Users/UsersResourceErrorMessages.*.resx
Languages: pt_br

# EMAIL_ALREADY_EXISTS
source: The E-mail already exists
pt_br: O E-mail Já existe

# EMAIL_EMPTY
source: The E-mail cannot be empty
pt_br: O E-mail não pode ser vazio

# EMAIL_INVALID
source: The E-mail is invalid
pt_br: O E-mail é inválido

# PASSWORD_EMPTY
source: The Password cannot be empty
pt_br: A senha não pode ser vazia

# PASSWORD_INVALID
source: Password must contain at least one uppercase letter, one lowercase letter, two numbers and one symbol
pt_br: A senha deve conter letras maíusculas, minúsculas, ao menos dois números e um símbolo

# PASSWORD_LENGHT
source: The password must be at least 8 characters long and be at most 50 characters
pt_br: A senha deve conter no mínimo 8 caractéres e não deve conter mais de 50 caractéres

# USERNAME_ALREADY_EXISTS
source: The Username already exists
pt_br: O usuário já existe

# USERNAME_EMPTY
source: The Username cannot be empty
pt_br: O usuário não pode ser vazio

# USERNAME_INVALID
source: The Username is invalid. Can have only letters, numbers or ._
pt_br: Usuário é inválido e deve conter apenas letras numéros e os símbolos: ._

# USERNAME_LENGHT
source: The Username must be at least 3 characters long and be at most 20 characters
pt_br: O usuário deve conter no mínimo 3 caractéres e no máximo 20 caractéres

# USER_ROLE_EMPTY
source: The User Role cannot be empty
pt_br: os direitos de usuário devem ser preenchidos

# USER_ROLE_INVALID
source: The UserRole must be 'admin' or 'user'
pt_br: os direitos de usuário devem ser preenchidos como: "admin" ou "user"
